import{s as l,j as s}from"./index-5e0e2173.js";import{E as i}from"./external-link.component-533607af.js";const r=()=>s.jsxs(n,{children:[s.jsx("h1",{children:"Привет!"}),s.jsxs("p",{children:["Меня зовут Артём, работаю в"," ",s.jsx(i,{href:"https://kotelov.com",children:"Котелове"})," ","(Москва). Занимаюсь профессиональной фронтенд-разработкой с 2019-го года. Основной стек:"," ",s.jsx("code",{children:"React+TS, `@tanstack/react-query`, sass-mod/styled"}),". Есть опыт с"," ",s.jsx("code",{children:"redux+toolkit, MobX, webpack/vite, react-*-form, mui/antd, OpenApi/Swagger, Django"}),"."]}),s.jsxs(c,{children:["Мои рандомные теги на 20 секунд вашей жизни:"," ",s.jsx("code",{children:"Селекты, таблицы, виртуальный скролл, диаграммы, сложные формы, svg+css, анимации, оптимизации бандла и ассетов, тесты, контрактное программирование, моки и точно что-то еще"}),"."]})]}),n=l.div`
  display: flex;
  flex-direction: column;
  gap: 16px;
`,c=l.p``,x=()=>s.jsxs(e,{children:[s.jsx("h1",{children:"Опыт работы"}),s.jsxs(e,{children:[s.jsxs("h4",{children:[s.jsx(i,{href:"https://kotelov.com",children:"KOTELOV"})," (Aug 23 - now)"]}),s.jsx("p",{children:"Занимаюсь разработкой админки лизинга для службы безопасности Газпромбанка."}),s.jsx("p",{children:"Что успел сделать: фича с документацией для сторонних сервисов, улучшение фичи с досье + мильйон апдейтов и фиксов."})]}),s.jsxs(e,{children:[s.jsxs("h4",{children:[s.jsx(i,{href:"https://sberbank.ru",children:"Sber"})," (Aug 22 - Jun 23)"]}),s.jsxs("p",{children:["Работал в 3 командах (блок ДИТ Риски).",s.jsx("br",{}),"Что сделал:",s.jsxs("ul",{children:[s.jsx("li",{children:"Сильно проапдейтил кредитный калькулятор для клиентов розничного бизнеса"}),s.jsx("li",{children:"Апдейтил фронтенд на последний вебпак, добавлял тесты, мелкие фичи"}),s.jsx("li",{children:"Редизайн приложения"})]})]})]}),s.jsxs(e,{children:[s.jsxs("h4",{children:[s.jsx(i,{href:"https://it-only.ru",children:"ONLY"})," (Aug 19 - Oct 21)"]}),s.jsxs("p",{children:["Сделал социальную сеть с уклоном в HR-потребности (что-то вроде Сбер-Пульса или Линкедина). Основные приколы:"," ",s.jsx("code",{children:"календарь, лента, посты, комментарии, профиль, стена, поиск, уведомления, сложные таблицы."}),s.jsx("br",{}),"Стек:",s.jsxs("ul",{children:[s.jsx("li",{children:"Vue2"}),s.jsx("li",{children:"TypeScript"}),s.jsx("li",{children:"VueX"}),s.jsx("li",{children:"CSS Modules"})]})]}),s.jsxs("p",{children:["Работал над приложением по контролю за процессами строительства для крупного ру-застройщика (вы о нем точно слышали). Основные достижения: ",s.jsx("code",{children:"много апдейтил Диаграмму Гантта, разрабатывал фунциональность согласований, загрузки файлов, сложные фильтры."}),s.jsx("br",{}),"Стек:",s.jsxs("ul",{children:[s.jsx("li",{children:"React+TS"}),s.jsx("li",{children:"MobX"}),s.jsx("li",{children:"Swagger/OpenApi"}),s.jsx("li",{children:"Ant Design"}),s.jsx("li",{children:"styled-components"})]})]}),s.jsxs("p",{children:["Помогал редизайнить веб-приложение для изучения английского языка.",s.jsx("br",{}),"Стек:",s.jsxs("ul",{children:[s.jsx("li",{children:"React+TS"}),s.jsx("li",{children:"MobX"}),s.jsx("li",{children:"Pure CSS (🙈)"})]})]})]}),s.jsxs(e,{children:[s.jsxs("h4",{children:[s.jsx(i,{href:"https://impulse.ua",children:'ЧАО СНПО "Импульс"'})," ","(Apr 18 - Aug 19)"]}),s.jsxs("p",{children:['Работал над аппаратно-программным комплексом контроля подвижных единиц (АКРО-Б). Разрабатывали прототип версии "Б".',s.jsx("br",{}),"Что сделал:",s.jsxs("ul",{children:[s.jsx("li",{children:"Серверная часть комплекса (принимала и отдавала пакеты с данными и прочее-прочее)"}),s.jsx("li",{children:'Клиентская часть для операторов ЖД станций (информирование о приближающихся подвижных составах, "тревоги", информация об оборудовании, действия с оборудованием (самодиагностика, автообогрев))'}),s.jsx("li",{children:"Дипломная работа бакалавра по этому проекту"})]}),"Стек:",s.jsxs("ul",{children:[s.jsx("li",{children:"C/C++11"}),s.jsx("li",{children:"libpthread"}),s.jsx("li",{children:"libsocket"}),s.jsx("li",{children:"Qt"})]})]})]})]}),e=l.div`
  display: flex;
  flex-direction: column;
  gap: 16px;

  ul {
    margin-left: 2rem;
  }
`,d=()=>s.jsxs(h,{children:[s.jsx(r,{}),s.jsx("hr",{}),s.jsx(x,{})]}),h=l.div`
  display: flex;
  margin: 0 auto;
  flex-direction: column;
  gap: 16px;
  text-shadow: none;
  background: #ffffff11;
  padding: 0 64px 16px 64px;

  max-width: 800px;

  p {
    text-align: justify;
    text-indent: 2em;
    text-justify: inter-word;

    &::first-line {
      margin-left: 8px;
    }
  }

  code {
    padding: 4px;
    background: white;
    color: black;
    text-shadow: none;
  }
`,o=()=>s.jsx(d,{});export{o as default};
